<?php
echo "1.ログ(意味、確認の仕方)"."<br>";
echo "やったことや起こったことの記録。コンソール.appから確認。"."<br>";
echo "2.クラウドサーバー、レンタルサーバー、VPSの違い"."<br>";
echo "クラウドサーバーはクラウド上にあるサーバーを利用する形式。レンタルサーバーはOS、データベース、HTTPサーバーをインストールした物理サーバーを、利用者で共有するもの。VPSはサーバーに複数の仮想サーバーを構築し、その１つひとつをユーザーに貸し出す形式。"."<br>";
echo "3.PHPのFWの種類と特徴"."<br>";
echo "Laravel:簡単なアプリケーションを自動生成できるのが特徴。CakePHP:素早く快適に開発ができ、日本語に翻訳されたドキュメントが多いなどが特徴。FuelPhp:C言語の拡張として書かれたフレームワーク。高速で動作する。CodeIgniter:高度で軽量で、シンプルでフレキシブルをテーマにしている小規模案件むけのオープンソースフレームワーク。CodeIgniter:自由度が他のフレームワークに比べ高いのが特徴。Yii:大規模なWebアプリケーション向けのコンポーネントベースのフレームワーク。アクセス負担が大きいサービスの使用に適してる。"."<br>";
?>